<?php
$a = 5;
$b = '05';
var_dump($a == $b);                             // Почему true? - php преобразует "05" в 5
var_dump((int)'012345');                        // Почему 12345?  - (int) перевела строку в целчоисленное значение
var_dump((float)123.0 === (int)123.0); // Почему false? 123.0 !== 123 - разные типы данных тождественно не равны
var_dump((int)0 === (int)'hello, world'); // Почему true? при переводе строки в целое число получается 0
?>





//Используя только две переменные, поменяйте их значение местами.

<?php
	$a=1
	$b=2
	$b = $b-$a
	$a=$a+$a


?>
